{"data":{"site":{"siteMetadata":{"title":"Chandler Moisen","author":"Chandler Moisen"}},"markdownRemark":{"id":"99dcad63-0e6e-5ba3-931d-f8d4325893af","excerpt":"In a recent discussion between Ben Horowitz and Tim Ferris, Horowitz, promoting his new book, What You Do Is Who You Are, notes that:A culture is not a set of…","html":"<p>In a recent discussion between <a href=\"https://tim.blog/2019/10/24/ben-horowitz/\">Ben Horowitz and Tim Ferris</a>, Horowitz, promoting his new book, <a href=\"https://www.amazon.com/What-You-Do-Who-Are/dp/0062871331/\">What You Do Is Who You Are</a>, notes that:</p>\n<blockquote>\n<p>A culture is not a set of beliefs, it’s a set of actions.</p>\n</blockquote>\n<p>Culture is paramount in startups - and not just to founders. Employees at early-stage firms are not only attempting to dent the universe through their work, but are also seeking to shape the culture that enables this work.</p>\n<p>I</p>\n<ul>\n<li>Founders should take heed while on week-long retreats to “discover” their values</li>\n<li>When culture is just something written down in a google doc and not realized per actions</li>\n<li>Leadership is responsible for ensuring culture remains a shared set of actions, not beliefs</li>\n</ul>\n<blockquote>\n<p>And that has to be across every dimension of the culture - you have to kind of program it in. Or, you are not going to have it. You’re going to talk it.</p>\n</blockquote>\n<ul>\n<li>More than anyone, leaders actions are under a microscope</li>\n<li>Seemingly trivial actions contrary to values has an outsized effect</li>\n</ul>\n<blockquote>\n<p>If you talk it, and don’t do it, then your culture becomes your hypocrisy</p>\n</blockquote>\n<ul>\n<li>Culture is paramount to startup employees</li>\n<li>Could there be a danger of fanaticism?</li>\n<li>You join a firm because you believe in the vision and culture</li>\n<li>If the values are not honored by leadership, will employees continue to buy into their vision?</li>\n</ul>","frontmatter":{"title":"Culture and Hypocrisy","date":"November 01, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/culture-of-hypocrisy/","previous":{"fields":{"slug":"/own-your-mistakes/"},"frontmatter":{"title":"Own Your Mistakes"}},"next":null}}