{"data":{"site":{"siteMetadata":{"title":"Chandler Moisen","author":"Chandler Moisen"}},"markdownRemark":{"id":"99dcad63-0e6e-5ba3-931d-f8d4325893af","excerpt":"In a recent discussion between Ben Horowitz and Tim Ferris, Horowitz, promoting his new book, What You Do Is Who You Are, notes that:A culture is not a set of…","html":"<p>In a recent discussion between <a href=\"https://tim.blog/2019/10/24/ben-horowitz/\">Ben Horowitz and Tim Ferris</a>, Horowitz, promoting his new book, <a href=\"https://www.amazon.com/What-You-Do-Who-Are/dp/0062871331/\">What You Do Is Who You Are</a>, notes that:</p>\n<blockquote>\n<p>A culture is not a set of beliefs, it’s a set of actions.</p>\n</blockquote>\n<p>Culture is paramount in startups - and not just to founders. Employees at early-stage firms are not only attempting to dent the universe through their work, but are also seeking to shape the culture that enables this work.</p>\n<p>As such, founders should take heed while embarking on retreats to discover (or rediscover) the values of their firms. When company culture becomes a few paragraphs within a Google Doc that no one can find it is certain that the values comprising the culture will be forgotten or mocked. One of the core responsibilities of leadership is to ensure that culture drives action and not belief.</p>\n<p>Horowitz goes on:</p>\n<blockquote>\n<p>If you talk it, and don’t do it, then your culture becomes your hypocrisy</p>\n</blockquote>\n<p>More than anyone, the actions of leaders are under a microscope. Seemingly trivial actions contrary to the values employees are buying into have an outsized demoralizing impact.</p>\n<p>Again: culture is paramount to startup employees. If the cultural values are not honored by leadership, will employees continue to buy into leadership’s vision?</p>","frontmatter":{"title":"Culture and Hypocrisy","date":"November 01, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/culture-of-hypocrisy/","previous":{"fields":{"slug":"/own-your-mistakes/"},"frontmatter":{"title":"Own Your Mistakes"}},"next":null}}