{"data":{"site":{"siteMetadata":{"title":"Chandler Moisen","author":"Chandler Moisen"}},"markdownRemark":{"id":"59c35c14-a552-5e6d-81a7-a793baba4e9b","excerpt":"Today I had the opportunity to speak with a group of 7th grade students about programming and a career in software engineering.These students gave up their…","html":"<p>Today I had the opportunity to speak with a group of 7th grade students about programming and a career in software engineering.</p>\n<p>These students gave up their lunch period for the opportunity to learn.</p>\n<p>Below are their unedited questions. Common themes were learning tips, career advice, and, surprising to me, the intersection of art and code.</p>\n<p>I found it heart-warming that such young individuals could ask such poignant questions. It gives me great hope for the future.</p>\n<h2>Questions</h2>\n<ol>\n<li>What program did you learn first?</li>\n<li>When did you start programming and with what language?</li>\n<li>How much do you make per year?</li>\n<li>How would you program a game using pre-existing art?</li>\n<li>Where do I start?</li>\n<li>How did you start your programming career?</li>\n<li>Was it hard to become a professional in programming?</li>\n<li>Can you suggest tips to become a pro programmer?</li>\n<li>How do I get a job for coding?</li>\n<li>What food is best to eat before extensive and intensive coding/web designing?</li>\n<li>How closely does coding and art go together?</li>\n<li>In animation, how does coding relate to the actual art?</li>\n<li>How many languages do you know?</li>\n<li>Is coding worth it?</li>\n<li>Make any video games?</li>\n<li>Do you animate?</li>\n<li>Where is a good college to find a job?</li>\n<li>What is the most flexible code language?</li>\n<li>How did you get into programming?</li>\n<li>Have you programmed any games, and how stressing is this process? (How much does this take a toll on your mental health?)</li>\n<li>Do you mainly do freelance web-design or do you professionally do it?\nDo you have any tips for me on how to improve my coding and typing skills?</li>\n</ol>","frontmatter":{"title":"What Seventh Graders Want to Know About Programming","date":"December 11, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/what-seventh-graders-want-to-know-about-programming/","previous":{"fields":{"slug":"/the-ass-rule/"},"frontmatter":{"title":"The ASS Rule"}},"next":{"fields":{"slug":"/you-can-filter-like-that/"},"frontmatter":{"title":"You Can Filter Like That?"}}}}