{"data":{"site":{"siteMetadata":{"title":"Chandler Moisen","author":"Chandler Moisen"}},"markdownRemark":{"id":"0dec091c-811d-5e5f-9e17-0ab9e19010ab","excerpt":"A friend lent me Elon Musk’s biographyFriend lent me Elon Musk biographyBook details Elon’s childhood through his successes at TBD, PayPal, SpaceX, Tesla, and…","html":"<p>A friend lent me Elon Musk’s biography</p>\n<ul>\n<li>Friend lent me Elon Musk biography</li>\n<li>Book details Elon’s childhood through his successes at TBD, PayPal, SpaceX, Tesla, and Solar City.</li>\n<li>Book also contains anecdotes re: Elon’s approach to business and leadership</li>\n<li>One particular story stood out: Elon sent an email to entire SpaceX team with the subject line “Acronyms Seriously Suck”:</li>\n</ul>\n<blockquote>\n<p>There is a creeping tendency to use made up acronyms at SpaceX. Excessive use of made up acronyms is a significant impediment to communication and keeping communication good as we grow is incredibly important. Individually, a few acronyms here and there may not seem so bad, but if a thousand people are making these up, over time the result will be a huge glossary that we have to issue to new employees. No one can actually remember all these acronyms and people don’t want to seem dumb in a meeting, so they just sit there in ignorance. This is particularly tough on new employees.</p>\n<p>That needs to stop immediately or I will take drastic action - I have given enough warning over the years. Unless an acronym is approved by me, it should not enter the SpaceX glossary. If there is an existing acronym that cannot reasonably be justified, it should be eliminated, as I have requested in the past.</p>\n<p>For example, there should be not “HTS” [horizontal test stand] or “VTS” [vertical test stand] designations for test stands. Those are particularly dumb, as they contain unnecessary words. A “stand” at our test site is obviously a <em>test</em> stand. VTS-3 is four syllables compared with “Tripod”, which is two, so the bloody acronym version actually takes longer to say than the name!</p>\n<p>The key test for an acronym is to ask whether it helps or hurts communication. An acronym that most engineers outside of SpaceX already know, such as GUI, is fine to use. It is also ok to make up a few acronyms/contractions every now and again, assuming I have approved them, e.g. MVac and M9 instead of Merlin 1C-Vacuum or Merlin 1C-Sea Level, but those need to be kept to a minimum.</p>\n</blockquote>\n<ul>\n<li>\n<p>The story caused personal reflection on use of acronyms</p>\n</li>\n<li>\n<p>Hard to recall a firm where use of acronyms was rampant</p>\n</li>\n<li>\n<p>People crack jokes about the acronym usage or when another was introduced</p>\n</li>\n<li>\n<p>Should take care when using acronyms:</p>\n</li>\n<li>\n<p>Remote teammates whose first language is not English</p>\n</li>\n<li>\n<p>It is disrespectful and unhelpful to new team members</p>\n</li>\n<li>\n<p>Use should be limited - if not eliminated - when writing technical requirments where ambiguity is paramount </p>\n</li>\n</ul>","frontmatter":{"title":"The ASS Rule","date":"November 03, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-ass-rule/","previous":{"fields":{"slug":"/on-culture/"},"frontmatter":{"title":"On Culture"}},"next":null}}